gineste/exotic-sid-v4-nrf52/Firmware/AppBase/Src/BLE/BLE_Application.c
/* 
 *    ____  _  _   __   ____   __    ___    ____  _  _  ____  ____  ____  _  _  ____
 *   (  __)( \/ ) /  \ (_  _) (  )  / __)  / ___)( \/ )/ ___)(_  _)(  __)( \/ )/ ___)
 *    ) _)  )  ( (  O )  )(    )(  ( (__   \___ \ )  / \___ \  )(   ) _) / \/ \\___ \     
 *   (____)(_/\_) \__/  (__)  (__)  \___)  (____/(__/  (____/ (__) (____)\_)(_/(____/
 *
 * Copyright (c) 2017 EXOTIC SYSTEMS. All Rights Reserved.
 *
 * Licensees are granted free, non-transferable use of the information. NO WARRANTY 
 * of ANY KIND is provided. This heading must NOT be removed from the file.
 *
 * Date:          9/10/2017 (dd MM YYYY)
 * Author:        Yoann Rebischung
 * Description:   BLE interface
 *
 */
 
/****************************************************************************************
 * Include Files
 ****************************************************************************************/
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

/* Config includes */
#include "BoardConfig.h"
#include "GlobalDefs.h"
#include "sdk_config.h"

/* SDK includes */
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
//#include "ble_radio_notification.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"

#include "fds.h"
#include "peer_manager.h"
#include "ble_conn_state.h"
#include "nrf_ble_gatt.h"

#if (BLE_DFU_ENABLED == 1)
   #include "ble_dfu.h"
   #include "nrf_pwr_mgmt.h"
#endif

/* Application BLE includes */
#include "BLE/BLE_Uart.h"
#include "BLE/BLE_Service.h"
#include "BLE/BT_Interface.h"

/* HAL include */
#include "HAL/HAL_Timer.h"

#include "ES_OpCodes.h"

#include "BLE_Application.h"

/****************************************************************************************
 * Defines
 ****************************************************************************************/
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2    /**< Reply when unsupported features are requested. */
/**< Name of device. Will be included in the advertising data. */
#define DEVICE_NAME                     CONCAT_STRG_2(DEFAULT_PREFIX_BLE_DEVICE_NAME,DEFAULT_BLE_DEVICE_NAME)

#define ADV_DATA_SIZE                   ((uint8_t)BLE_GAP_ADV_MAX_SIZE)
#define MANUFACTURER_NAME               "Exotic-Systems"                         /**< Manufacturer. Will be passed to Device Information Service. */
#define MANUFACTURER_ID                 (uint16_t)0x071D                         /**< exoTIC Systems Manufacturer ID */
#define BLE_TX_POWER                    ((int8_t)(-20))                           /**< TX Power Level value. This will be set both in the TX Power service, in the advertising data, and also used to set the radio transmit power. */

#define APP_ADV_FAST_INTERVAL           FAST_ADV_INT_BLE_COMP                 /**< The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms). */
#define APP_ADV_SLOW_INTERVAL           SLOW_ADV_INT_BLE_COMP                 /**< The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms). */

#define APP_ADV_FAST_TIMEOUT_IN_SECONDS FAST_ADV_TIMEOUT_BLE                  /**< The advertising timeout in units of seconds. */
#define APP_ADV_SLOW_TIMEOUT_IN_SECONDS SLOW_ADV_TIMEOUT_BLE                  /**< The advertising timeout in units of seconds. */

#define APP_BLE_OBSERVER_PRIO           1                                        /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                        /**< A tag identifying the SoftDevice BLE configuration. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(12, UNIT_1_25_MS)          /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(48, UNIT_1_25_MS)          /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                   0                                        /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)          /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  HAL_TIMER_MS_TO_TICKS(500)               /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   HAL_TIMER_MS_TO_TICKS(100)               /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    16                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                  1                                       /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                       /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                       /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                       /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                    /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                       /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                      /**< Maximum encryption key size. */

/****************************************************************************************
 * Private type declarations
 ****************************************************************************************/

/****************************************************************************************
 * Private function declarations
 ****************************************************************************************/
static void vOnAdvEvt(ble_adv_evt_t p_eBleAdvEvt);
static void vPeerManagerEvtHandler(pm_evt_t const * p_cpsEvt);
static void vOnConnParamsEvt(ble_conn_params_evt_t * p_psEvt);
static void vConnParamsErrorHandler(uint32_t p_u32NrfError);
static void vBleEvtHandler(ble_evt_t const * p_ble_evt, void * p_context);
static void vGattEvtHandler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt);
static void vPeerManagerInit(void);
static void vAdvertisingInit(void);
static void vConnParamsInit(void);
static void vBleStackInit(void);
static void vGapParamsInit(void);
static void vGattInit(void);
static void vServicesInit(void);
static void vAdvertisingStart(bool p_bEraseBonds);
static void vDeleteBonds(void);

