gineste/exotic-sid-v4-nrf52/Firmware/AppBase/Src/BLE/BLE_Application.c
#if (BLE_DFU_ENABLED == 1)
   static void vOnBleDFUEvtHandler(ble_dfu_buttonless_evt_type_t p_sDFUEvent);
   static bool bShutdownHandler(nrf_pwr_mgmt_evt_t p_sEvent);
#endif

static void vBleUartEvtHandler(s_Ble_Service_Evt_t * p_psEvt);

/****************************************************************************************
 * Variable declarations
 ****************************************************************************************/ 
/* YOUR_JOB: Declare all services structure your application is using
 *  BLE_XYZ_DEF(m_xyz);
 */
NRF_BLE_GATT_DEF(g_GattInstance);                                             /**< GATT module instance. (Generic Attribute Service) */
BLE_ADVERTISING_DEF(g_AdvertisingInstance);                                   /**< Advertising module instance. */
NRF_PWR_MGMT_HANDLER_REGISTER(bShutdownHandler, 0);                           /**< Register application shutdown handler with priority 0. */

#ifndef DEBUG
static 
#endif
char g_achBleDeviceName[DEVICE_NAME_SIZE_MAX] = { 0 }; 
static ble_advdata_t g_sAdvData;
static ble_advdata_t g_sSrAdvData;
#ifndef DEBUG
static 
#endif
uint8_t g_au8AdvData[ADV_DATA_SIZE_MAX] = { 0u };
#ifndef DEBUG
static 
#endif
uint8_t g_au8SrAdvData[ADV_INFO_SIZE] = { 0u };
static uint8_t g_u8SizeSrAdvData = 0u;

/* TODO Remove Last BleEvent and register as Observer with low priority instead */
#ifndef DEBUG
static 
#endif
e_Ble_Event_t g_LastBleEvent = BLE_EVENT_INIT;
static e_Ble_Adv_State_t g_eAdvState = BLE_ADV_EVT_IDLE;
static uint16_t g_u16ConnHandle = BLE_CONN_HANDLE_INVALID;                    /**< Handle of the current connection. */
// YOUR_JOB: Use UUIDs for service(s) used in your application.
//static ble_uuid_t g_adv_uuids[] =                                             /**< Universally unique service identifiers. */
//{
//    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
//};

/****************************************************************************************
 * Public functions
 ****************************************************************************************/ 
/**@brief  Initialise the BLE module.
 *
 * @return None.
 */
void vBLE_Init(void)
{  
   vBleStackInit();
   vPeerManagerInit(); 
   vGapParamsInit();
   vGattInit();
   vAdvertisingInit();
   vServicesInit();
   vConnParamsInit();
}

/**@brief  Start Advertising BLE.
 * @param[in] p_eAdvMode Type of advertise
 * @return None.
 */
void vBLE_AdvertisingStart(e_Ble_Adv_Mode_t p_eAdvMode)
{
   uint32_t l_u32ErrCode = ble_advertising_start(&g_AdvertisingInstance, p_eAdvMode);
   APP_ERROR_CHECK(l_u32ErrCode);
}

/**@brief  Stop Advertising BLE.
 * @return None.
 */
void vBLE_AdvertisingStop(void)
{
   if(g_eAdvState != (e_Ble_Adv_State_t)BLE_ADV_MODE_IDLE)
   {
      APP_ERROR_CHECK(sd_ble_gap_adv_stop());
   }
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
void vBLE_SleepModeEnter(void)
{
   PRINT_ERROR("%s","Power Off");
   
   // Go to system-off mode (this function will not return; wakeup will cause a reset).
   APP_ERROR_CHECK(sd_power_system_off());
}

e_Ble_Event_t eBLE_EventGet(void)
{
   return g_LastBleEvent;
}

e_Ble_Adv_State_t eBLE_AdvertiseStateGet(void)
{
   return g_eAdvState;
}

void vBLE_SoftDeviceDisable(void)
{
   APP_ERROR_CHECK(nrf_sdh_disable_request());
}
void vBLE_SrAdvDataInit(uint8_t * p_pu8Data, uint8_t p_u8Size)
{

}
void vBLE_SrAdvDataUpdate(uint8_t * p_pu8Data, uint8_t p_u8Size)
{
   uint32_t l_u32ErrCode = 0u;
   
   ble_advdata_manuf_data_t l_sDataResponse;
   
   if( (p_u8Size < SR_ADV_DATA_SIZE_MAX) && (p_pu8Data != NULL) )
   {
      /* Copy Data */
      g_au8SrAdvData[0u] = BOARD_TYPE;
      g_au8SrAdvData[1u] = USE_CASE_NUMBER;
      memcpy(&g_au8SrAdvData[2u], p_pu8Data, p_u8Size);
      /* Compute Size */
      g_u8SizeSrAdvData = p_u8Size + 2u;
      
      l_sDataResponse.company_identifier = MANUFACTURER_ID;
      l_sDataResponse.data.p_data = g_au8SrAdvData;
      l_sDataResponse.data.size = g_u8SizeSrAdvData;      

      g_sSrAdvData.p_manuf_specific_data = &l_sDataResponse;
      
      if((g_LastBleEvent == BLE_EVENT_DISCONNECTED) || (g_LastBleEvent == BLE_EVENT_INIT))
      {
         l_u32ErrCode = ble_advdata_set(&g_sAdvData, &g_sSrAdvData);
      }

      //l_u32ErrCode = sd_ble_gap_adv_data_set(NULL, 0, l_au8SrAdvResp, l_au8SrAdvResp[0u]);
      APP_ERROR_CHECK(l_u32ErrCode);
   }
}
void vBLE_AdvDataUpdate(uint8_t * p_pu8Data, uint8_t p_u8Size)
{
   uint8_t l_u8Size = 0u;
   uint8_t l_u8NameSize = 0u;
   
   memset(g_au8AdvData, 0u, sizeof(g_au8AdvData));
   /* Size Check */
   l_u8Size = (p_u8Size > ADV_SENS_DATA_SIZE)? ADV_SENS_DATA_SIZE: p_u8Size;
   /* Size of Advertise data (+5 for Manufacturer specific) */
   g_au8AdvData[0u] = l_u8Size + 5u;
   
   g_au8AdvData[1u] = BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
   g_au8AdvData[2u] = LSB_16B_TO_8B(MANUFACTURER_ID);
   g_au8AdvData[3u] = MSB_16B_TO_8B(MANUFACTURER_ID);
   /* Device Type (1: SF, 2: DL, 3: SID) */
   g_au8AdvData[4u] = BOARD_TYPE;
   /* Use Case */
   g_au8AdvData[5u] = USE_CASE_NUMBER;

   /* Our custom data to advertise */   
   memcpy(&g_au8AdvData[6u], p_pu8Data, l_u8Size);
   /* Size Check */
   l_u8NameSize = ((strlen(g_achBleDeviceName) + 1u) > DEVICE_NAME_SIZE_MAX)? DEVICE_NAME_SIZE_MAX: (strlen(g_achBleDeviceName) + 1u);
   
   g_au8SrAdvData[0u] = l_u8NameSize + 1u; 
   g_au8SrAdvData[1u] = BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME;
   memcpy(&g_au8SrAdvData[2u], g_achBleDeviceName, l_u8NameSize);
}

void vBLE_UpdateName(char * p_chDeviceName, uint8_t p_u8Size)
{
	uint32_t l_u32ErrCode = 0u;
   uint8_t l_u8NameSize = 0u;
   ble_gap_conn_sec_mode_t	l_sSecMode;
   
   if(strncmp(p_chDeviceName, DEFAULT_PREFIX_BLE_DEVICE_NAME, strlen(DEFAULT_PREFIX_BLE_DEVICE_NAME)) == 0)
   {      
      memset(g_achBleDeviceName, 0u, DEVICE_NAME_SIZE_MAX);
      l_u8NameSize = (p_u8Size > DEVICE_NAME_SIZE_MAX)?DEVICE_NAME_SIZE_MAX:p_u8Size;
      memcpy(g_achBleDeviceName, p_chDeviceName, l_u8NameSize);
         
      BLE_GAP_CONN_SEC_MODE_SET_OPEN(&l_sSecMode);
      l_u32ErrCode = sd_ble_gap_device_name_set(&l_sSecMode, (const uint8_t *)p_chDeviceName, l_u8NameSize);
      APP_ERROR_CHECK(l_u32ErrCode);
	  
