gineste/exotic-sid-v4-nrf52/Firmware/AppBase/Src/BLE/BLE_Application.c
      PRINT_INFO("%s","Updated Board Name : ");
      PRINT_GREEN("%s\n", g_achBleDeviceName);
   }
}

/****************************************************************************************
 * Private functions
 ****************************************************************************************/
/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void vOnAdvEvt(ble_adv_evt_t p_eBleAdvEvt)
{
   switch (p_eBleAdvEvt)
   {
      case BLE_ADV_EVT_FAST:
         g_eAdvState = p_eBleAdvEvt;
         PRINT_INFO("%s","Ble : ");
         PRINT_STATE("%s\n","Fast advertising");
         break;
      case BLE_ADV_EVT_SLOW:
         g_eAdvState = p_eBleAdvEvt;
         PRINT_INFO("%s","Ble : ");
         PRINT_STATE("%s\n","Slow advertising");
         break;

      case BLE_ADV_EVT_IDLE:
         g_eAdvState = p_eBleAdvEvt;
         PRINT_INFO("%s","Ble : ");
         PRINT_WARNING("%s","Advertise OFF");
//         vBLE_SleepModeEnter();
         break;       

      default:
      break;
   }
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void vPeerManagerEvtHandler(pm_evt_t const * p_cpsEvt)
{
   uint32_t l_u32ErrCode;

   switch (p_cpsEvt->evt_id)
   {
      case PM_EVT_BONDED_PEER_CONNECTED:
      {
         PRINT_INFO("%s\n","PM Bonded device connected");
      } break;

      case PM_EVT_CONN_SEC_SUCCEEDED:
      {
         
      } break;

      case PM_EVT_CONN_SEC_FAILED:
      {
         /* Often, when securing fails, it shouldn't be restarted, for security reasons.
         * Other times, it can be restarted directly.
         * Sometimes it can be restarted, but only after changing some Security Parameters.
         * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
         * Sometimes it is impossible, to secure the link, or the peer device does not support it.
         * How to handle this error is highly application dependent. */
      } break;

      case PM_EVT_CONN_SEC_CONFIG_REQ:
      {
         // Reject pairing request from an already bonded peer.
         pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
         pm_conn_sec_config_reply(p_cpsEvt->conn_handle, &conn_sec_config);
      } break;

      case PM_EVT_STORAGE_FULL:
      {
         // Run garbage collection on the flash.
         l_u32ErrCode = fds_gc();
         if (l_u32ErrCode == FDS_ERR_BUSY || l_u32ErrCode == FDS_ERR_NO_SPACE_IN_QUEUES)
         {
            // Retry.
         }
         else
         {
            APP_ERROR_CHECK(l_u32ErrCode);
         }
      } break;

      case PM_EVT_PEERS_DELETE_SUCCEEDED:
      {
         PRINT_INFO("%s\n","PM Delete succeeded");
         vAdvertisingStart(false);
      } break;

      case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
      {
         // The local database has likely changed, send service changed indications.
         pm_local_database_has_changed();
      } break;

      case PM_EVT_PEER_DATA_UPDATE_FAILED:
      {
         // Assert.
         APP_ERROR_CHECK(p_cpsEvt->params.peer_data_update_failed.error);
      } break;

      case PM_EVT_PEER_DELETE_FAILED:
      {
         // Assert.
         APP_ERROR_CHECK(p_cpsEvt->params.peer_delete_failed.error);
      } break;

      case PM_EVT_PEERS_DELETE_FAILED:
      {
         // Assert.
         APP_ERROR_CHECK(p_cpsEvt->params.peers_delete_failed_evt.error);
      } break;

      case PM_EVT_ERROR_UNEXPECTED:
      {
         // Assert.
         APP_ERROR_CHECK(p_cpsEvt->params.error_unexpected.error);
      } break;

      case PM_EVT_CONN_SEC_START:
      case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
      case PM_EVT_PEER_DELETE_SUCCEEDED:
      case PM_EVT_LOCAL_DB_CACHE_APPLIED:
      case PM_EVT_SERVICE_CHANGED_IND_SENT:
      case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
      default:
      break;
   }
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_psEvt  Event received from the Connection Parameters Module.
 */
static void vOnConnParamsEvt(ble_conn_params_evt_t * p_psEvt)
{
   uint32_t l_u32ErrCode;

   if (p_psEvt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
   {
      l_u32ErrCode = sd_ble_gap_disconnect(g_u16ConnHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
      APP_ERROR_CHECK(l_u32ErrCode);
   }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void vConnParamsErrorHandler(uint32_t p_u32NrfError)
{
   APP_ERROR_HANDLER(p_u32NrfError);
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void vBleEvtHandler(ble_evt_t const * p_ble_evt, void * p_context)
{
   uint32_t l_u32ErrCode = NRF_SUCCESS;

   switch (p_ble_evt->header.evt_id)
   {
      case BLE_GAP_EVT_CONNECTED:
         g_LastBleEvent = BLE_EVENT_CONNECTED;
         g_u16ConnHandle = p_ble_evt->evt.gap_evt.conn_handle;
         break;
      
      case BLE_GAP_EVT_DISCONNECTED:
         g_LastBleEvent = BLE_EVENT_DISCONNECTED;
         g_u16ConnHandle = BLE_CONN_HANDLE_INVALID;
         break;
   #if defined(S132)
      case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
      {
         ble_gap_phys_t const phys = {
          .rx_phys = BLE_GAP_PHY_AUTO,
          .tx_phys = BLE_GAP_PHY_AUTO,
         };
         l_u32ErrCode = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
         APP_ERROR_CHECK(l_u32ErrCode);
      }
      break;
   #endif

      case BLE_GATTC_EVT_TIMEOUT:
         // Disconnect on GATT Client timeout event.
         l_u32ErrCode = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                       BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
         APP_ERROR_CHECK(l_u32ErrCode);
         g_LastBleEvent = BLE_EVENT_DISCONNECTED;
      break;

      case BLE_GATTS_EVT_TIMEOUT:
         // Disconnect on GATT Server timeout event.
         l_u32ErrCode = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                       BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
         APP_ERROR_CHECK(l_u32ErrCode);
         g_LastBleEvent = BLE_EVENT_DISCONNECTED;
      break;

      case BLE_EVT_USER_MEM_REQUEST:
         l_u32ErrCode = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
         APP_ERROR_CHECK(l_u32ErrCode);
      break;

      case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
      {
      ble_gatts_evt_rw_authorize_request_t  req;
      ble_gatts_rw_authorize_reply_params_t auth_reply;

      req = p_ble_evt->evt.gatts_evt.params.authorize_request;

         if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
         {
            if((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
               (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
               (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
            {
               if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
               {
                  auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
               }
               else
               {
                  auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
               }
               auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
               l_u32ErrCode = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle, &auth_reply);
               APP_ERROR_CHECK(l_u32ErrCode);
            }
         }
      } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

      
      case BLE_GAP_EVT_SCAN_REQ_REPORT:
      break;
      case BLE_GAP_EVT_ADV_REPORT:
      break;
      
      default:
      // No implementation needed.
      break;
   }
}

static void vGattEvtHandler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
   switch(p_evt->evt_id)
   {
      case NRF_BLE_GATT_EVT_ATT_MTU_UPDATED:
         vBLE_Uart_onGattEvt(p_evt);
         break;
      case NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED:
         break;
      default:
         break;
   }
}

/**@brief Function for the Peer Manager initialization.
 */
static void vPeerManagerInit(void)
{
   uint32_t l_u32ErrCode;
   ble_gap_sec_params_t l_sSecParam;

   l_u32ErrCode = pm_init();
   APP_ERROR_CHECK(l_u32ErrCode);

   memset(&l_sSecParam, 0, sizeof(ble_gap_sec_params_t));

   // Security parameters to be used for all security procedures.
   l_sSecParam.bond           = SEC_PARAM_BOND;
   l_sSecParam.mitm           = SEC_PARAM_MITM;
   l_sSecParam.lesc           = SEC_PARAM_LESC;
   l_sSecParam.keypress       = SEC_PARAM_KEYPRESS;
   l_sSecParam.io_caps        = SEC_PARAM_IO_CAPABILITIES;
   l_sSecParam.oob            = SEC_PARAM_OOB;
   l_sSecParam.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
   l_sSecParam.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
   l_sSecParam.kdist_own.enc  = 1;
   l_sSecParam.kdist_own.id   = 1;
   l_sSecParam.kdist_peer.enc = 1;
   l_sSecParam.kdist_peer.id  = 1;

   l_u32ErrCode = pm_sec_params_set(&l_sSecParam);
   APP_ERROR_CHECK(l_u32ErrCode);

   l_u32ErrCode = pm_register(vPeerManagerEvtHandler);
   APP_ERROR_CHECK(l_u32ErrCode);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void vAdvertisingInit(void)
{
   uint32_t l_u32ErrCode;
   ble_advertising_init_t l_sInit;

   memset(&l_sInit, 0, sizeof(l_sInit));
   // Build and set advertising data
   memset(&g_sAdvData, 0, sizeof(ble_advdata_t));

   l_sInit.advdata.name_type               = BLE_ADVDATA_SHORT_NAME;
   l_sInit.advdata.short_name_len          = 7u;
   l_sInit.advdata.include_appearance      = false;
   l_sInit.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
   //l_sInit.advdata.uuids_complete.uuid_cnt = sizeof(g_adv_uuids) / sizeof(g_adv_uuids[0]);
   //l_sInit.advdata.uuids_complete.p_uuids  = g_adv_uuids;
   
   ble_advdata_manuf_data_t l_sManufDataResponse;
   l_sInit.srdata.name_type = BLE_ADVDATA_NO_NAME;
   l_sManufDataResponse.company_identifier = MANUFACTURER_ID;
   l_sManufDataResponse.data.p_data = g_au8SrAdvData;
   l_sManufDataResponse.data.size = ADV_INFO_SIZE;//SR_ADV_DATA_SIZE_MAX;
   
   l_sInit.srdata.p_manuf_specific_data = &l_sManufDataResponse;   
   
#if (ENABLE_BLE == 1)
   l_sInit.config.ble_adv_fast_enabled  = true;
   l_sInit.config.ble_adv_slow_enabled  = true;   
   l_sInit.config.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
   l_sInit.config.ble_adv_fast_timeout  = APP_ADV_FAST_TIMEOUT_IN_SECONDS;
   l_sInit.config.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
   l_sInit.config.ble_adv_slow_timeout  = APP_ADV_SLOW_TIMEOUT_IN_SECONDS;
#else   
   l_sInit.config.ble_adv_fast_enabled  = false;
   l_sInit.config.ble_adv_slow_enabled  = false;
   l_sInit.config.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
   l_sInit.config.ble_adv_fast_timeout  = 0;
   l_sInit.config.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
   l_sInit.config.ble_adv_slow_timeout  = 0;
#endif   // (ENABLE_BLE == 1)

   l_sInit.evt_handler = vOnAdvEvt;
   
   g_sAdvData = l_sInit.advdata;
   g_sSrAdvData = l_sInit.srdata;
   
   l_u32ErrCode = ble_advertising_init(&g_AdvertisingInstance, &l_sInit);
   APP_ERROR_CHECK(l_u32ErrCode);
   
   ble_advertising_conn_cfg_tag_set(&g_AdvertisingInstance, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void vConnParamsInit(void)
{
   uint32_t l_u32ErrCode;
   ble_conn_params_init_t l_sCpInit;

   memset(&l_sCpInit, 0, sizeof(l_sCpInit));

   l_sCpInit.p_conn_params                  = NULL;
   l_sCpInit.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
   l_sCpInit.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
   l_sCpInit.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
   l_sCpInit.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
   l_sCpInit.disconnect_on_fail             = false;
   l_sCpInit.evt_handler                    = vOnConnParamsEvt;
   l_sCpInit.error_handler                  = vConnParamsErrorHandler;

   l_u32ErrCode = ble_conn_params_init(&l_sCpInit);
   APP_ERROR_CHECK(l_u32ErrCode);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void vBleStackInit(void)
{
   uint32_t l_u32ErrCode;
   uint32_t ram_start = 0;

