gineste/exotic-sid-v4-nrf52/Firmware/AppBase/Src/BLE/BLE_Application.c
   l_u32ErrCode = nrf_sdh_enable_request();
   APP_ERROR_CHECK(l_u32ErrCode);
   
   // Configure the BLE stack using the default settings.
   // Fetch the start address of the application RAM.
   l_u32ErrCode = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
   APP_ERROR_CHECK(l_u32ErrCode);
   // Enable BLE stack.
   l_u32ErrCode = nrf_sdh_ble_enable(&ram_start);
   APP_ERROR_CHECK(l_u32ErrCode);
   
   // Register a handler for BLE events.
   NRF_SDH_BLE_OBSERVER(g_BLE_Template_Observer, APP_BLE_OBSERVER_PRIO, vBleEvtHandler, NULL);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void vGapParamsInit(void)
{
   uint32_t l_u32ErrCode = 0u;
   uint8_t l_u8Size = 0u;
   ble_gap_conn_params_t l_sGapConnParams;
   ble_gap_conn_sec_mode_t l_sSecMode;
   ble_gap_addr_t l_sDeviceAddr;
   char l_pchDefaultName[DEVICE_NAME_SIZE_MAX] = { '\0' };
   char l_pchDefaultPrefix[DEVICE_NAME_SIZE_MAX] = { '\0' };
  
   memcpy(l_pchDefaultPrefix, DEFAULT_PREFIX_BLE_DEVICE_NAME, strlen(DEFAULT_PREFIX_BLE_DEVICE_NAME));
   
   sd_ble_gap_addr_get(&l_sDeviceAddr);

   l_u8Size = snprintf( (char*)l_pchDefaultName, DEVICE_NAME_SIZE_MAX, "%s_%02X%02X", 
               DEVICE_NAME, l_sDeviceAddr.addr[1],l_sDeviceAddr.addr[0]);
   l_u8Size = (l_u8Size > DEVICE_NAME_SIZE_MAX)? DEVICE_NAME_SIZE_MAX : l_u8Size;
   
   PRINT_INFO("%s","Default Board Name : ");
   PRINT_GREEN("%s\n", l_pchDefaultName);
   BLE_GAP_CONN_SEC_MODE_SET_OPEN(&l_sSecMode);

   memcpy(g_achBleDeviceName, l_pchDefaultName, l_u8Size);
   
   l_u32ErrCode = sd_ble_gap_device_name_set(&l_sSecMode,
                                          (const uint8_t *)g_achBleDeviceName,
                                          strlen(g_achBleDeviceName));
   APP_ERROR_CHECK(l_u32ErrCode);

   /* YOUR_JOB: Use an appearance value matching the application's use case.
    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
    APP_ERROR_CHECK(err_code); */
//   l_u32ErrCode = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_TAG);
//   APP_ERROR_CHECK(l_u32ErrCode);

   memset(&l_sGapConnParams, 0, sizeof(l_sGapConnParams));

   l_sGapConnParams.min_conn_interval = MIN_CONN_INTERVAL;
   l_sGapConnParams.max_conn_interval = MAX_CONN_INTERVAL;
   l_sGapConnParams.slave_latency     = SLAVE_LATENCY;
   l_sGapConnParams.conn_sup_timeout  = CONN_SUP_TIMEOUT;

   l_u32ErrCode = sd_ble_gap_ppcp_set(&l_sGapConnParams);
   APP_ERROR_CHECK(l_u32ErrCode);
                                          
   l_u32ErrCode = sd_ble_gap_tx_power_set(BLE_TX_POWER);
   APP_ERROR_CHECK(l_u32ErrCode);
}


/**@brief Function for initializing the GATT module.
 */
static void vGattInit(void)
{
   uint32_t l_u32ErrCode = nrf_ble_gatt_init(&g_GattInstance, vGattEvtHandler);
   APP_ERROR_CHECK(l_u32ErrCode);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void vServicesInit(void)
{
   uint32_t l_u32ErrCode = 0u;
   /* YOUR_JOB: Add code to initialize the services used by the application.
   uint32_t                         err_code;
   ble_xxs_init_t                     xxs_init;
   ble_yys_init_t                     yys_init;

   // Initialize XXX Service.
   memset(&xxs_init, 0, sizeof(xxs_init));

   xxs_init.evt_handler                = NULL;
   xxs_init.is_xxx_notify_supported    = true;
   xxs_init.ble_xx_initial_value.level = 100;

   err_code = ble_bas_init(&m_xxs, &xxs_init);
   APP_ERROR_CHECK(err_code);

   // Initialize YYY Service.
   memset(&yys_init, 0, sizeof(yys_init));
   yys_init.evt_handler                  = on_yys_evt;
   yys_init.ble_yy_initial_value.counter = 0;

   err_code = ble_yy_service_init(&yys_init, &yy_init);
   APP_ERROR_CHECK(err_code);
   */

   
   vBLE_Uart_ServiceInit(vBleUartEvtHandler);
   
#if (BLE_DFU_ENABLED == 1)
   ble_dfu_buttonless_init_t l_sSecureDFUInit = {
      .evt_handler = vOnBleDFUEvtHandler
   };

    // Initialize the async SVCI interface to bootloader.
   l_u32ErrCode = ble_dfu_buttonless_async_svci_init();
   if(l_u32ErrCode != 0u)
   {
      PRINT_WARNING("Async DFU Service Error ! %d", l_u32ErrCode);
   }
   else
   {      
      l_u32ErrCode = ble_dfu_buttonless_init(&l_sSecureDFUInit);   
      if(l_u32ErrCode != 0u)
      {
         PRINT_WARNING("%s","DFU Init Service Error !");
      }
   }
#endif
   
}



/**@brief Function for starting advertising.
 */
static void vAdvertisingStart(bool p_bEraseBonds)
{
   uint32_t l_u32ErrCode;
   
   if (p_bEraseBonds == true)
   {
      vDeleteBonds();
      // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED evetnt
   }
   else
   {
      l_u32ErrCode = ble_advertising_start(&g_AdvertisingInstance, BLE_ADV_MODE_FAST);
      APP_ERROR_CHECK(l_u32ErrCode);
   }
}

/**@brief Clear bond information from persistent storage.
 */
static void vDeleteBonds(void)
{
   uint32_t l_u32ErrCode;

   l_u32ErrCode = pm_peers_delete();
   APP_ERROR_CHECK(l_u32ErrCode);
}

#if (BLE_DFU_ENABLED == 1)
// YOUR_JOB: Update this code if you want to do anything given a DFU event (optional).
/**@brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void vOnBleDFUEvtHandler(ble_dfu_buttonless_evt_type_t p_sDFUEvent)
{
    switch(p_sDFUEvent)
    {
        case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
            // YOUR_JOB: Disconnect all bonded devices that currently are connected.
            //           This is required to receive a service changed indication
            //           on bootup after a successful (or aborted) Device Firmware Update.
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER:
            // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
            //           by delaying reset by reporting false in app_shutdown_handler
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            break;

