gineste/exotic-sid-v4-nrf52/Firmware/AppBase/Src/BLE/BLE_Application.c
        case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            APP_ERROR_CHECK(false);
            break;

        default:
            break;
    }
}

/**@brief Handler for shutdown preparation.
 *
 * @details During shutdown procedures, this function will be called at a 1 second interval
 *          untill the function returns true. When the function returns true, it means that the
 *          app is ready to reset to DFU mode.
 *
 * @param[in]   event   Power manager event.
 *
 * @retval  True if shutdown is allowed by this power manager handler, otherwise false.
 */
static bool bShutdownHandler(nrf_pwr_mgmt_evt_t p_sEvent)
{
   uint32_t l_u32ErrCode;
   
   switch (p_sEvent)
   {
   #if (BLE_DFU_ENABLED == 1)
      case NRF_PWR_MGMT_EVT_PREPARE_DFU:
         // YOUR_JOB: Get ready to reset into DFU mode
         //
         // If you aren't finished with any ongoing tasks, return "false" to
         // signal to the system that reset is impossible at this stage.
         //
         // Here is an example using a variable to delay resetting the device.
         //
         // if (!m_ready_for_reset)
         // {
         //      return false;
         // }
         // else
         //{
         //
         //    // Device ready to enter
         //    uint32_t err_code;
             l_u32ErrCode = nrf_sdh_disable_request();
             APP_ERROR_CHECK(l_u32ErrCode);
         //    err_code = app_timer_stop_all();
         //    APP_ERROR_CHECK(err_code);
         //}
         break;
   #endif
      case NRF_PWR_MGMT_EVT_PREPARE_SYSOFF:
      case NRF_PWR_MGMT_EVT_PREPARE_WAKEUP:
      case NRF_PWR_MGMT_EVT_PREPARE_RESET:
      default:
         // YOUR_JOB: Implement any of the other events available from the power management module:
         //      -NRF_PWR_MGMT_EVT_PREPARE_SYSOFF
         //      -NRF_PWR_MGMT_EVT_PREPARE_WAKEUP
         //      -NRF_PWR_MGMT_EVT_PREPARE_RESET
         break;
   }

   return true;
}

#endif /* (BLE_DFU_ENABLE == 1) */


/**@brief Function for handling the Uart Service event.
 * @param[in]   p_evt   ble event.
 */
static void vBleUartEvtHandler(s_Ble_Service_Evt_t * p_psEvt)
{
   switch ( p_psEvt->u16EvtType ) 
   {
      case BLE_UART_EVT_DATA_RECEIVED:
         vBT_ITF_DataReceived(p_psEvt->psCh->sData.pu8Data, p_psEvt->psCh->sData.u16Length);
         break;

      case BLE_UART_EVT_DATA_SENT:
         break;

      default:
         break;
   }
}

/****************************************************************************************
 * End Of File
 ****************************************************************************************/
